app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Mon, 03 Feb 2014 18:40:32 UTC +00:00], ["updated_at", Mon, 03 Feb 2014 18:40:32 UTC +00:00], ["username", "mluukkai"]]